Джира/src/Catalogs/Центр_ВидыЗадач/Центр_ВидыЗадач.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Центр_ВидыЗадач</name>
  <predefined>
    <items>
      <name>Внешняя</name>
      <description>Внешняя</description>
    </items>
    <items>
      <name>Внутренняя</name>
      <description>Внутренняя</description>
    </items>
    <items>
      <name>Личная</name>
      <description>Личная</description>
    </items>
  </predefined>
</mdclass:Catalog>

Джира/src/Enums/Центр_ПредставленияВидовЗадачПоПостановщику/Центр_ПредставленияВидовЗадачПоПостановщику.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Центр_ПредставленияВидовЗадачПоПостановщику</name>
  <enumValues>
    <name>Партнер</name>
  </enumValues>
  <enumValues>
    <name>Пользователь</name>
  </enumValues>
</mdclass:Enum>

Джира/src/Catalogs/Центр_ВидыЗадач/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПереключательПостановщика = 
		ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Партнер") Тогда
		Объект.Партнер = Истина;
	ИначеЕсли ПереключательПостановщика = 
		ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Пользователь") Тогда
		Объект.Партнер = Ложь;
	Иначе 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = ("Не выбран Партнер или Пользователь");
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Если Объект.Партнер Тогда
		ПереключательПостановщика = 
			ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Партнер");
	Иначе
		ПереключательПостановщика = 
			ПредопределенноеЗначение("Перечисление.Центр_ПредставленияВидовЗадачПоПостановщику.Пользователь");
	КонецЕсли;
КонецПроцедуры
#КонецОбласти
